package Words::Armenian;

use strict;
use Exporter 'import';
use utf8;
use vars qw( %ORTHOGRAPHY %SPELLINGS %PREFIXES %SUFFIXES @EXPORT_OK );

@EXPORT_OK = qw( am_downcase );

sub am_downcase {
    my $word = shift;
    my @letters = split( '', $word );
    my $out = '';
    foreach( @letters ) {
	if( $_ =~ /[\x{531}-\x{556}]/ ) {
	    my $codepoint = unpack( "U", $_ );
	    $codepoint += 48;
	    $out .= pack( "U", $codepoint );
	} else {
	    $out .= $_
	}
    }
    return $out;
}

sub canonize_word {
    my $word  = shift;

    # We don't really distinguish between commas and semicolons properly
    # in the manuscript.  Make them the same.
    $word =~ s/\./\,/g;

    # Get rid of accent marks.
    $word =~ s/՛//g;
    # Get rid of hyphen.
    $word =~ s/֊//g;
    # Get rid of any backtick that falls mid-word.
    $word =~ s/՝(.)/$1/g;

    return $word;
}

# The canonized word comes to us here.  We return a comparison string.
sub comparator {
    my $word = shift;

    # Standardize ligatures.
    $word =~ s/աւ/օ/g;  # for easy vocalic comparison to ո
    $word =~ s/և/եւ/g; 

    # Downcase the word.
    $word = am_downcase( $word );

    return $word;
}    

# What is coming to us here is the word after going through canonization.
sub print_word {
    my $word = shift;
    
    # Undo ligature contraction.
    $word =~ s/օ/աւ/g;  # because it is never wrong
    $word =~ s/եւ/և/g;  # likewise

    # Try to split into prefix/base/suffix.
    my( $pre, $base, $suf ) = split_word( $word );

    # Now try to find a canonical spelling.
    if( exists( $ORTHOGRAPHY{$base} ) ) {
    	$base = $ORTHOGRAPHY{$base};
    } elsif( exists( $ORTHOGRAPHY{$pre.$base} ) ) {
	$base = $ORTHOGRAPHY{$pre.$base};
	$pre = '';
    } elsif( exists( $ORTHOGRAPHY{$base.$suf} ) ) {
	$base = $ORTHOGRAPHY{$base.$suf};
	$suf = '';
    } elsif( exists( $ORTHOGRAPHY{$pre.$base.$suf} ) ) {
	$base = $ORTHOGRAPHY{$pre.$base.$suf};
	$pre = $suf = '';
    }
    return "$pre$base$suf";

}


## Takes a word and splits off anything that looks like it might be a prefix or a suffix.
sub split_word {
    my $word = shift;
    my( $pre, $base, $suff );
    if( $word =~ /^([զյց])(.*)$/ ) {
	( $pre, $base ) = ( $1, $2 );
    } else {
	( $pre, $base ) = ( '', $word );
    }

    if( $base =~ /^(.*)([նդս])$/ ) {
	( $base, $suff ) = ( $1, $2 );
    } else {
	$suff = '';
    }

    return( $pre, $base, $suff );
}


## Data hashes

%ORTHOGRAPHY = ( 
    'նըշան' => 'նշան',
    'նըշանին' => 'նշանին',
    'այսըմ' => 'այսմ',
    'հըրէից' => 'հրէից',
    'սըրտիւ' => 'սրտիւ',
    'վարդապետըն' => 'վարդապետն',
    );

%SPELLINGS = (
    'կատարծի' => 'կատարածի',
    'Բարկանա' => 'Բարկանայ',
    'ահայ' => 'ահա',
    'աղտին' => 'ախտին',
    'այսմհետէ' => 'յայսմհետէ',
    'անտիոքա' => 'անտիոքայ',
    'արարածցս' => 'արարածոցս',
    'արութեանն' => 'արիութեանն',
    'դէգերեն' => 'դեգերին',
    'դէգերին' => 'դեգերին',
    'երկուշաբթին' => 'երկուշաբաթին',
    'զաւրմարտի' => 'զաւրամարտի',
    'զբնայբանն' => 'զբնաբանն',
    'զնայ' => 'զնա',
    'խաւատանէգն' => 'խաւատանէքն',
    'կաին' => 'կային',
    'հաոց' => 'հայոց',
    'հաւատո' => 'հաւատոյ',
    'հերա' => 'հերայ',
    'մայտանն' => 'մատանն',
    'մատուցանողին' => 'մատուցողին',
    'մատուցնողին' => 'մատուցողին',
    'յուռհայ' => 'յուռհա',
    'նմայ' => 'նմա',
    'նորայ' => 'նորա',
    'շտապո' => 'շտապոյ',
    'պատագելոց' => 'պատարագելոց',
    'պաքարումն' => 'պայքարումն',
    'պեղծ' => 'պիղծ',
    'սիրո' => 'սիրոյ',
    'փաղչի' => 'փախչի',
    'քահայայիցն' => 'քահանայիցն',
    );

%PREFIXES = (
    'յա' => 'յա',
    'յադամայ' => 'յ|ադամայ',
    'յադամայէին' => 'յ|ադամայէին',
    'յազգէ' => 'յ|ազգէ',
    'յազգէն' => 'յ|ազգէն',
    'յազդումն' => 'յ|ազդումն',
    'յաթոռ' => 'յ|աթոռ',
    'յաթոռն' => 'յ|աթոռն',
    'յաթոռոյ' => 'յ|աթոռոյ',
    'յաթոռոյն' => 'յ|աթոռոյն',
    'յականատեսք' => 'յականատեսք',
    'յահաբեկեալ' => 'յ|ահաբեկեալ',
    'յահագին' => 'յ|ահագին',
    'յահաւոր' => 'յ|ահաւոր',
    'յաղաւթք' => 'յ|աղաւթք',
    'յաղէկսսանդրու' => 'յ|աղէկսսանդրու',
    'յաղէքսանդրիոյ' => 'յ|աղէքսանդրիոյ',
    'յաղջկունս' => 'յ|աղջկունս',
    'յամ' => 'յ|ամ',
    'յամառնային' => 'յ|ամառնային',
    'յամաւթով' => 'յ|ամաւթով',
    'յամենայն' => 'յ|ամենայն',
    'յամենայնի' => 'յ|ամենայնի',
    'յամէ' => 'յ|ամէ',
    'յամի' => 'յ|ամի',
    'յամին' => 'յ|ամին',
    'յամիս' => 'յ|ամիս',
    'յամիսս' => 'յ|ամիսս',
    'յամս' => 'յ|ամս',
    'յայժմ' => 'յայժմ',
    'յայլ' => 'յ|այլ',
    'յայլազգեացն' => 'յ|այլազգեացն',
    'յայլոց' => 'յ|այլոց',
    'յայն' => 'յ|այն',
    'յայնմ' => 'յ|այնմ',
    'յայնմիկ' => 'յ|այնմիկ',
    'յայնմիկ՝' => 'յ|այնմիկ՝',
    'յայնոսիկ' => 'յ|այնոսիկ',
    'յայնոսիկ՝' => 'յ|այնոսիկ՝',
    'յայնցեալ' => 'յ|այնցեալ',
    'յայսկոյս' => 'յ|այսկոյս',
    'յայսմ' => 'յ|այսմ',
    'յայսմիկ' => 'յ|այսմիկ',
    'յայսոսիկ' => 'յ|այսոսիկ',
    'յայսոցիկ' => 'յ|այսոցիկ',
    'յայսու' => 'յ|այսու',
    'յայրմանէ' => 'յ|այրմանէ',
    'յանապատ' => 'յ|անապատ',
    'յանաւրէն' => 'յ|անաւրէն',
    'յանաւրինաց' => 'յ|անաւրինաց',
    'յանդադար' => 'յ|անդադար',
    'յանդաստանացն' => 'յ|անդաստանացն',
    'յանդիոք' => 'յ|անդիոք',
    'յանդունդն' => 'յ|անդունդն',
    'յանդունդս' => 'յ|անդունդս',
    'յանեցի' => 'յ|անեցի',
    'յանկասկած' => 'յ|անկասկած',
    'յանկարծակի' => 'յանկարծակի',
    'յանհաւանութիւնս' => 'յ|անհաւանութիւնս',
    'յանձ' => 'յ|անձ',
    'յանձիթ' => 'յանձիթ',
    'յանձին' => 'յ|անձին',
    'յանձինս' => 'յ|անձինս',
    'յանձն' => 'յ|անձն',
    'յանմիկ' => 'յ|անմիկ',
    'յանունն' => 'յ|անունն',
    'յանպարիսբ' => 'յ|անպարիսբ',
    'յանջանս' => 'յ|անջանս',
    'յանտէր' => 'յ|անտէր',
    'յանտիոք' => 'յ|անտիոք',
    'յանտիոքա' => 'յ|անտիոքա',
    'յանտիոքայ' => 'յ|անտիոքայ',
    'յանտիոքացւոց' => 'յ|անտիոքացւոց',
    'յանտիրութենէ' => 'յ|անտիրութենէ',
    'յանտիրութենէն' => 'յ|անտիրութենէն',
    'յաշխարհ' => 'յ|աշխարհ',
    'յաշխարհաց' => 'յ|աշխարհաց',
    'յաշխարհին' => 'յ|աշխարհին',
    'յաշխարհն' => 'յ|աշխարհն',
    'յապագայից' => 'յ|ապագայից',
    'յապագայիցն' => 'յ|ապագայիցն',
    'յապականել' => 'յ|ապականել',
    'յաջոյ' => 'յ|աջոյ',
    'յառաջինն' => 'յ|առաջինն',
    'յառաւաւտն' => 'յ|առաւաւտն',
    'յասորոց' => 'յ|ասորոց',
    'յասորւոց' => 'յ|ասորւոց',
    'յասպարիզի՝' => 'յ|ասպարիզի՝',
    'յասպարիսի' => 'յ|ասպարիսի',
    'յաստեացս' => 'յ|աստեացս',
    'յաստուծոյ' => 'յ|աստուծոյ',
    'յատենագրութիւն' => 'յ|ատենագրութիւն',
    'յատենի' => 'յ|ատենի',
    'յատնեա՛ց' => 'յ|ատնեա՛ց',
    'յարարեալ' => 'յ|արարեալ',
    'յարդար' => 'յ|արդար',
    'յարդարադատէն' => 'յ|արդարադատէն',
    'յարեամբ' => 'յ|արեամբ',
    'յարեանարբու' => 'յ|արեանարբու',
    'յարեւելից' => 'յ|արեւելից',
    'յարեւելս' => 'յ|արեւելս',
    'յարեւմուտ' => 'յ|արեւմուտ',
    'յարեւմուտս' => 'յ|արեւմուտս',
    'յարեւմուտք' => 'յ|արեւմուտք',
    'յարեւմուտքն' => 'յ|արեւմուտքն',
    'յարեւմտից' => 'յ|արեւմտից',
    'յարիութեանն' => 'յ|արիութեանն',
    'յարիւն' => 'յ|արիւն',
    'յարիւնն' => 'յ|արիւնն',
    'յարկնի' => 'յ|արկնի',
    'յարուեստաւոր' => 'յ|արուեստաւոր',
    'յարտայայտէ' => 'յ|արտայայտէ',
    'յարքայութեանն' => 'յ|արքայութեանն',
    'յաւելորդ' => 'յ|աւելորդ',
    'յաւետարանէ' => 'յ|աւետարանէ',
    'յաւետարանէն' => 'յ|աւետարանէն',
    'յաւետարանն' => 'յ|աւետարանն',
    'յաւետարէ՛' => 'յ|աւետարէ՛',
    'յաւերումն' => 'յ|աւերումն',
    'յաւուր' => 'յ|աւուր',
    'յաւուրս' => 'յ|աւուրս',
    'յաւուրսն' => 'յ|աւուրսն',
    'յաւուրց' => 'յ|աւուրց',
    'յաւր' => 'յ|աւր',
    'յաւրն' => 'յ|աւրն',
    'յաքսորանս' => 'յ|աքսորանս',
    'յաքսորս' => 'յ|աքսորս',
    'յաքսորք' => 'յ|աքսորք',
    'յեզեր' => 'յ|եզեր',
    'յեզր' => 'յ|եզր',
    'յեկեղեցականաւք' => 'յ|եկեղեցականաւք',
    'յեկեղեցականքն' => 'յ|եկեղեցականքն',
    'յեկեղեցեացն' => 'յ|եկեղեցեացն',
    'յեկեղեցի' => 'յ|եկեղեցի',
    'յեկեղեցին' => 'յ|եկեղեցին',
    'յեկեղեցիք' => 'յ|եկեղեցիք',
    'յեկեղեցւոյ' => 'յ|եկեղեցւոյ',
    'յեկղցւոյն' => 'յ|եկղցւոյն',
    'յեկնից' => 'յ|եկնից',
    'յեղբայր' => 'յ|եղբայր',
    'յեղբարսն' => 'յ|եղբարսն',
    'յեղբարց' => 'յ|եղբարց',
    'յեղբաւրէ' => 'յ|եղբաւրէ',
    'յերեսաց' => 'յ|երեսաց',
    'յերեսս' => 'յ|երեսս',
    'յերից' => 'յ|երից',
    'յերկինս' => 'յ|երկինս',
    'յերկիր' => 'յ|երկիր',
    'յերկիրն' => 'յ|երկիրն',
    'յերկնային' => 'յ|երկնային',
    'յերկնից' => 'յ|երկնից',
    'յերկոցունց' => 'յ|երկոցունց',
    'յերկրի' => 'յ|երկրի',
    'յերկրին' => 'յ|երկրին',
    'յերուսաղէմայ' => 'յ|երուսաղէմայ',
    'յիմ' => 'յ|իմ',
    'յիմաստագրութիւն' => 'յ|իմաստագրութիւն',
    'յիմաստագրութիւնն' => 'յ|իմաստագրութիւնն',
    'յիմացեալ' => 'յ|իմացեալ',
    'յինէն' => 'յ|ինէն',
    'յիշխան' => 'յ|իշխան',
    'յիշխանաց' => 'յ|իշխանաց',
    'յիշխանութիւնս' => 'յ|իշխանութիւնս',
    'յիւր' => 'յ|իւր',
    'յիւրաքանչիւրում' => 'յ|իւրաքանչիւրում',
    'յիւրեանց' => 'յ|իւրեանց',
    'յիւրոց' => 'յ|իւրոց',
    'յշտապոյ' => 'յ|շտապոյ',
    'յո՜չնչէ' => 'յ|ո՜չնչէ',
    'յոչ' => 'յ|ոչ',
    'յոչինչ' => 'յ|ոչինչ',
    'յոչինչոյ' => 'յ|ոչինչոյ',
    'յոչնչէ' => 'յ|ոչնչէ',
    'յոչնչոյ' => 'յ|ոչնչոյ',
    'յոսկո' => 'յ|ոսկո',
    'յոսկոյ' => 'յ|ոսկոյ',
    'յոսկւոյ' => 'յ|ոսկւոյ',
    'յովկիանոս' => 'յ|ովկիանոս',
    'յովկիանոսի' => 'յ|ովկիանոսի',
    'յորդի' => 'յ|որդի',
    'յորդին' => 'յ|որդին',
    'յորդո' => 'յ|որդո',
    'յորդոյ' => 'յ|որդոյ',
    'յորդւոյ' => 'յ|որդւոյ',
    'յորում' => 'յ|որում',
    'յուզմամբ' => 'յուզմամբ',
    'յուժին' => 'յ|ուժին',
    'յունայ' => 'յունայ',
    'յունաց' => 'յունաց',
    'յունէր' => 'յունէր',
    'յուռհա' => 'յ|ուռհա',
    'յուռհայ' => 'յ|ուռհայ',
    'յուռհայեցի' => 'յ|ուռհայեցի',
    'յուռհայեցոյ' => 'յ|ուռհայեցոյ',
    'յուռհայոյ' => 'յ|ուռհայոյ',
    'յուռհայու' => 'յ|ուռհայու',
    'յուռհացոյ' => 'յ|ուռհացոյ',
    'յուրախութիւն' => 'յ|ուրախութիւն',
    'յսյսկոյս' => 'յ|սյսկոյս',
    );

%SUFFIXES = ();

1;
